<a href="https://colab.research.google.com/github/Suman5501/AI-lab-assignment/blob/main/6_CSL5402.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

LAB-06 Assignment (CSL5402)
---

Q1. WAP to evaluate the estimated salary of a person having experience 6.5years, 7.9 years and 20 years. The dataset for this task will be Position_salaries.csv. ( All the students are required to perform Linear regression using python libraries to complete this task )

Q 2.  WAP to estimate the Root mean square error for the Linear regression model on the Google stock price dataset. Students may use python libraries to estimate the error.

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
data = pd.read_csv('/content/Position_Salaries.csv')
data.head(10)

            Position  Level   Salary
0   Business Analyst      1    45000
1  Junior Consultant      2    50000
2  Senior Consultant      3    60000
3            Manager      4    80000
4    Country Manager      5   110000
5     Region Manager      6   150000
6            Partner      7   200000
7     Senior Partner      8   300000
8            C-level      9   500000
9                CEO     10  1000000

            Position  Level   Salary
0   Business Analyst      1    45000
1  Junior Consultant      2    50000
2  Senior Consultant      3    60000
3            Manager      4    80000
4    Country Manager      5   110000
5     Region Manager      6   150000
6            Partner      7   200000
7     Senior Partner      8   300000
8            C-level      9   500000
9                CEO     10  1000000

In [ ]:
x = data[["Level"]]
y = data[["Salary"]]
x
y

    Salary
0    45000
1    50000
2    60000
3    80000
4   110000
5   150000
6   200000
7   300000
8   500000
9  1000000

In [ ]:
#regression model 
from sklearn.linear_model import LinearRegression
regressor = LinearRegression()
regressor.fit(x,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [ ]:
#testing on random value
print("Predicted values for 3.5 years, 7.5 years and 40 years respectively are : ")
print(regressor.predict([[3.5]])[0] ,regressor.predict([[7.5]])[0], regressor.predict([[40]])[0] )

Predicted values for 3.5 years, 7.5 years and 40 years respectively are :
[87742.42424242] [411257.57575758] [3039818.18181818]

In [ ]:
#testing on given value
print("Predicted values for 6.5 years, 7.9 years and 20 years respectively are : ")
print(regressor.predict([[6.5]])[0], regressor.predict([[7.9]])[0], regressor.predict([[20]])[0] )

Predicted values for 6.5 years, 7.9 years and 20 years respectively are :
[330378.78787879] [443609.09090909] [1422242.42424242]

In [ ]:
train_data = pd.read_csv('/content/Google_Stock_Price_Train.csv')
test_data = pd.read_csv('/content/Google_Stock_Price_Test.csv')
train_data.head(10)

        Date    Open    High     Low   Close      Volume
0   1/3/2012  325.25  332.83  324.97  663.59   7,380,500
1   1/4/2012  331.27  333.87  329.08  666.45   5,749,400
2   1/5/2012  329.83  330.75  326.89  657.21   6,590,300
3   1/6/2012  328.34  328.77  323.68  648.24   5,405,900
4   1/9/2012  322.04  322.29  309.46  620.76  11,688,800
5  1/10/2012  313.70  315.72  307.30  621.43   8,824,000
6  1/11/2012  310.59  313.52  309.40  624.25   4,817,800
7  1/12/2012  314.43  315.26  312.08  627.92   3,764,400
8  1/13/2012  311.96  312.30  309.37  623.28   4,631,800
9  1/17/2012  314.81  314.81  311.67  626.86   3,832,800

In [ ]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1258 entries, 0 to 1257
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    1258 non-null   object
 1   Open    1258 non-null   float64
 2   High    1258 non-null   float64
 3   Low     1258 non-null   float64
 4   Close   1258 non-null   float64
 5   Volume  1258 non-null   int64
dtypes: float64(4), int64(1), object(1)
memory usage: 59.1+ KB

In [ ]:
test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Open    20 non-null     float64
 2   High    20 non-null     float64
 3   Low     20 non-null     float64
 4   Close   20 non-null     float64
 5   Volume  20 non-null     int64
dtypes: float64(4), int64(1), object(1)
memory usage: 1.1+ KB

In [ ]:
train_data.replace(',','',regex=True,inplace=True)
test_data.replace(',','',regex=True,inplace=True)
train_data[['Close','Volume']] = train_data[['Close','Volume']].apply(pd.to_numeric)
test_data[['Close','Volume']] = test_data[['Close','Volume']].apply(pd.to_numeric)
train_data.head(10)

        Date    Open    High     Low   Close    Volume
0   1/3/2012  325.25  332.83  324.97  663.59   7380500
1   1/4/2012  331.27  333.87  329.08  666.45   5749400
2   1/5/2012  329.83  330.75  326.89  657.21   6590300
3   1/6/2012  328.34  328.77  323.68  648.24   5405900
4   1/9/2012  322.04  322.29  309.46  620.76  11688800
5  1/10/2012  313.70  315.72  307.30  621.43   8824000
6  1/11/2012  310.59  313.52  309.40  624.25   4817800
7  1/12/2012  314.43  315.26  312.08  627.92   3764400
8  1/13/2012  311.96  312.30  309.37  623.28   4631800
9  1/17/2012  314.81  314.81  311.67  626.86   3832800

In [ ]:
x_train = train_data[['Open', 'High', 'Low', 'Volume']]
y_train = train_data['Close']
x_test = test_data[['Open', 'High', 'Low', 'Volume']]
y_test = test_data['Close']

In [ ]:
#regression model 
from sklearn.linear_model import LinearRegression
regressor2 = LinearRegression()
regressor2.fit(x_train,y_train)

y_predict = regressor2.predict(x_test)

In [ ]:
y_predict

array([754.40588319, 798.71235287, 795.07824942, 743.57927405,
       829.4820455 , 842.971888  , 824.66560288, 819.38288804,
       853.16453882, 836.00568628, 850.32137505, 809.50764   ,
       865.09686812, 747.53742228, 836.37799812, 813.03267399,
       868.59517571, 750.37950626, 807.90366731, 817.04218114])

In [ ]:
y_test.values

array([786.14, 786.9 , 794.02, 806.15, 806.65, 804.79, 807.91, 806.36,
       807.88, 804.61, 806.07, 802.17, 805.02, 819.31, 823.87, 835.67,
       832.15, 823.31, 802.32, 796.79])

In [ ]:
from sklearn import metrics
print('Root Mean Squared Error :', np.sqrt(metrics.mean_squared_error(y_test, y_predict)))

Root Mean Squared Error : 38.11730407638581